### Pandas and Matplotlib

What shall we look at today:

1. Series
2. Data Frames
3. Missing Data
4. Group by operation
5. Merging and Joining data
6. Data Input and output

In [1]:
# Importing libraries to use 
import numpy as np
import pandas as pd

#### Series

In [6]:
data = [10,20,30,50,60,70,80,90,100]

In [7]:
sr = pd.Series(data)
sr

0     10
1     20
2     30
3     50
4     60
5     70
6     80
7     90
8    100
dtype: int64

In [26]:
sr[0]

10

In [8]:
arr = np.array(data)

In [9]:
arr

array([ 10,  20,  30,  50,  60,  70,  80,  90, 100])

In [11]:
sr2 = arr*2

In [12]:
sr2 = pd.Series(data2)

In [13]:
sr2

0     20
1     40
2     60
3    100
4    120
5    140
6    160
7    180
8    200
dtype: int64

In [19]:
sr3 = pd.Series(arr,index =["Ten","Twenty","Thirsty", "Forty","Fifty", "Seventy","Eighty","Ninty", "Akutat"])

In [20]:
sr3

Ten         10
Twenty      20
Thirsty     30
Forty       50
Fifty       60
Seventy     70
Eighty      80
Ninty       90
Akutat     100
dtype: int64

In [21]:
sr3 = pd.Series(df,index =["Ten","Twenty","Thirsty", "Forty","Fifty", "Seventy","Eighty","Ninty", "Akutat"])
sr3

Ten       NaN
Twenty    NaN
Thirsty   NaN
Forty     NaN
Fifty     NaN
Seventy   NaN
Eighty    NaN
Ninty     NaN
Akutat    NaN
dtype: float64

In [24]:
sr4 = pd.Series([1,2,3,4,5],['One','Two','Three','Four','Five'])
sr4

One      1
Two      2
Three    3
Four     4
Five     5
dtype: int64

sr5 = pd.Series([1,2,3,4,5],['One','Two','Three','Four','Five'],[10,20,30,40,50])
sr5

#### Data Frame

In [27]:
from numpy.random import randn
np.random.seed(20181103)

In [33]:
df = pd.DataFrame(randn(6,4),['Row1','Row2','Row3','Row4','Row5','Row6'],['Col1','Col2','Col3','Col4'])
df

          Col1      Col2      Col3      Col4
Row1 -0.578051 -0.385324 -0.393287 -0.600691
Row2  0.179533  1.133490 -0.124513 -0.505521
Row3 -0.150642 -0.101774  0.198806  0.006953
Row4 -0.212524 -0.070746 -0.727089  0.561509
Row5  0.813920 -0.806957 -1.850687  0.522721
Row6 -1.492537  0.029730 -0.426199 -0.279941

In [35]:
df[['Col1','Col2']]

          Col1      Col2
Row1 -0.578051 -0.385324
Row2  0.179533  1.133490
Row3 -0.150642 -0.101774
Row4 -0.212524 -0.070746
Row5  0.813920 -0.806957
Row6 -1.492537  0.029730

In [49]:
df[::-1] # not experienced with this. play around with it

          Col1      Col2      Col3      Col4
Row6 -1.492537  0.029730 -0.426199 -0.279941
Row5  0.813920 -0.806957 -1.850687  0.522721
Row4 -0.212524 -0.070746 -0.727089  0.561509
Row3 -0.150642 -0.101774  0.198806  0.006953
Row2  0.179533  1.133490 -0.124513 -0.505521
Row1 -0.578051 -0.385324 -0.393287 -0.600691

In [50]:
df['Col7'] = df['Col1'] + df['Col2']

In [51]:
df

          Col1      Col2      Col3      Col4      Col7
Row1 -0.578051 -0.385324 -0.393287 -0.600691 -0.963375
Row2  0.179533  1.133490 -0.124513 -0.505521  1.313022
Row3 -0.150642 -0.101774  0.198806  0.006953 -0.252416
Row4 -0.212524 -0.070746 -0.727089  0.561509 -0.283269
Row5  0.813920 -0.806957 -1.850687  0.522721  0.006962
Row6 -1.492537  0.029730 -0.426199 -0.279941 -1.462808

In [56]:
# Removing Columns

df.drop('Col3', axis = 1) # 1 means columns while 0 means rows for axis

          Col1      Col2      Col4      Col7
Row1 -0.578051 -0.385324 -0.600691 -0.963375
Row2  0.179533  1.133490 -0.505521  1.313022
Row3 -0.150642 -0.101774  0.006953 -0.252416
Row4 -0.212524 -0.070746  0.561509 -0.283269
Row5  0.813920 -0.806957  0.522721  0.006962
Row6 -1.492537  0.029730 -0.279941 -1.462808

In [57]:
df.drop('Row2',axis=0)

          Col1      Col2      Col3      Col4      Col7
Row1 -0.578051 -0.385324 -0.393287 -0.600691 -0.963375
Row3 -0.150642 -0.101774  0.198806  0.006953 -0.252416
Row4 -0.212524 -0.070746 -0.727089  0.561509 -0.283269
Row5  0.813920 -0.806957 -1.850687  0.522721  0.006962
Row6 -1.492537  0.029730 -0.426199 -0.279941 -1.462808

In [61]:
df.iloc[0]

Col1   -0.578051
Col2   -0.385324
Col3   -0.393287
Col4   -0.600691
Col7   -0.963375
Name: Row1, dtype: float64

In [64]:
df.loc['Row1']

Col1   -0.578051
Col2   -0.385324
Col3   -0.393287
Col4   -0.600691
Col7   -0.963375
Name: Row1, dtype: float64

### Missing Values

In [65]:
df_na = {'Col1':[1000,3000,np.nan],'Col2':[4000,np.nan,np.nan],'Col3':[3000,2000,3000]} # dictionary
df_na

{'Col1': [1000, 3000, nan],
 'Col2': [4000, nan, nan],
 'Col3': [3000, 2000, 3000]}

In [66]:
# Lets now change the dictionary to df

df_na = pd.DataFrame(df_na)
df_na

     Col1    Col2  Col3
0  1000.0  4000.0  3000
1  3000.0     NaN  2000
2     NaN     NaN  3000

In [67]:
df_na.dropna()

     Col1    Col2  Col3
0  1000.0  4000.0  3000

In [68]:
df_na.dropna(thresh=1) # thresh = 1 means keep only the rows with atleast 1 non_na

     Col1    Col2  Col3
0  1000.0  4000.0  3000
1  3000.0     NaN  2000
2     NaN     NaN  3000

In [69]:
df_na.dropna(thresh=2)

     Col1    Col2  Col3
0  1000.0  4000.0  3000
1  3000.0     NaN  2000

In [70]:
df_na.fillna(value= 0)

     Col1    Col2  Col3
0  1000.0  4000.0  3000
1  3000.0     0.0  2000
2     0.0     0.0  3000

In [71]:
df_na['Col1'].fillna(value=df_na['Col1'].mean()) # this is what i do 90% of the time

0    1000.0
1    3000.0
2    2000.0
Name: Col1, dtype: float64

### Group By

In [72]:
data = {'D_Type':['Shorts','Shorts','Pantaloons','Pantaloons','Cargo','Cargo'],
       'Person':['Mark','Richard','Joachim','Goddy','Green','Asa'],
       'Height':[1.83,1.80,1.75,1.94,1.82,1.64]}

In [77]:
data = pd.DataFrame(data)
data

       D_Type   Person  Height
0      Shorts     Mark    1.83
1      Shorts  Richard    1.80
2  Pantaloons  Joachim    1.75
3  Pantaloons    Goddy    1.94
4       Cargo    Green    1.82
5       Cargo      Asa    1.64

In [74]:
data.groupby('D_Type')

In [75]:
data_grouped = data.groupby('D_Type')

In [76]:
data_grouped.mean()

            Height
D_Type
Cargo        1.730
Pantaloons   1.845
Shorts       1.815

In [79]:
data_grouped.std()

              Height
D_Type
Cargo       0.127279
Pantaloons  0.134350
Shorts      0.021213

In [80]:
data_grouped.var()

             Height
D_Type
Cargo       0.01620
Pantaloons  0.01805
Shorts      0.00045

In [81]:
data_grouped.count()

            Person  Height
D_Type
Cargo            2       2
Pantaloons       2       2
Shorts           2       2

In [82]:
data_grouped.describe()

           Height
            count   mean       std   min     25%    50%     75%   max
D_Type
Cargo         2.0  1.730  0.127279  1.64  1.6850  1.730  1.7750  1.82
Pantaloons    2.0  1.845  0.134350  1.75  1.7975  1.845  1.8925  1.94
Shorts        2.0  1.815  0.021213  1.80  1.8075  1.815  1.8225  1.83

### Merging

1. left: use only keys from left frame
2. right: use only keys from right frame
3. outer: use union of keys from both frames
4. inner: use intersection of keys from both frames

In [7]:
df1 = pd.DataFrame({'Col1': [20,30,90,40],
                        'Col2': [38,29,21,40],
                        'Col3': [40,30,29,28],
                        'Col4': [39,29,28,30]},
                        index=[0, 1, 2, 3])

In [3]:
df1

   Col1  Col2  Col3  Col4
0    20    38    40    39
1    30    29    30    29
2    90    21    29    28
3    40    40    28    30

In [4]:
df2 = pd.DataFrame({'Col1': [28,50,70,30],
                        'Col2': [35,50,39,50],
                        'Col3': [70,50,39,48],
                        'Col4': [59,20,23,50]},
                        index=[0, 1, 2, 3])

In [5]:
df2

   Col1  Col2  Col3  Col4
0    28    35    70    59
1    50    50    50    20
2    70    39    39    23
3    30    50    48    50

In [6]:
pd.merge(df1,df2)

Empty DataFrame
Columns: [Col1, Col2, Col3, Col4]
Index: []

In [10]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': [30,40,20,13],
                     'B': [50,30,50,10]})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': [90,30,50,30],
                          'D': [40,20,40,80]})

In [11]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  30  50  90  40
1  K1  40  30  30  20
2  K2  20  50  50  40
3  K3  13  10  30  80